# NumberOfBarPositions Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarInSystem..::..NumberOfBarPositions Property
RebarInSystem Class See Also
---
The number of bar positions available in the rebar.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int NumberOfBarPositions { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NumberOfBarPositions As Integer
	Get
```

Visual C++
---
```text
public:
property int NumberOfBarPositions {
	int get ();
}
```

# See Also
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace